raindropFoam_internal/2DraindropTest/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    left
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    right
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    bot
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }    
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
