raindropFoam_internal/2DraindropTest/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

/*
regions
(
    sphereToCell
    {
        centre (0.0 0.0 -0.020); radius 0.0005;
    	fieldValues
    	(
       	    volScalarFieldValue alpha.water 1
   	 );
    }
);
*/

regions
(
    cylinderToCell
    {
        p1 (0.0 -0.1 -0.020); p2 (0.0 0.1 -0.020); radius 0.002;
    fieldValues
    (
        volScalarFieldValue alpha.water 1
        volVectorFieldValue U (0 0 -1)
    );
    }
);


// ************************************************************************* //
